Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/svd/PIC32CZ8110CA80144.svd
            <register>
               <name>FFLTSYN</name>
               <description>Flash ECC Fault Syndrome Register</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECSYN</name>
                     <description>Single Error Correction Syndrome</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>DEDSYN</name>
                     <description>DED Syndrome</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DERR</name>
                     <description>Double Error Detected &amp; Single Error Corrected</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>CERR</name>
                     <description>ECC Control bit Error</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTLSTAT</name>
                     <description>Parity vs ECC Control Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PERR</name>
                     <description>Per Word Parity Error Status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRP</name>
               <description>CFM Page Read Protect Register</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BC1RP</name>
                     <description>Boot Configuration Page 1 Read Protect Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BC2RP</name>
                     <description>Boot Configuration Page 2 Read Protect Bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BC1RPLOCK</name>
                     <description>Boot Configuration Page 1 RP Lock Bit</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BC2RPLOCK</name>
                     <description>Boot Configuration Page 2 RP Lock Bit</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMCTRL</name>
               <description>HSM CFM PAGES Control Register</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ECCDIS</name>
                     <description>ECC Disable for HSM Pages in CFM</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYZ</name>
                     <description>Flash Key Locations read 0\xd5 s</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>FCW</name>
         <version>034331a1</version>
         <description>Flash Write Control (FCW)</description>
         <baseAddress>0x44002000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xD0</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FCW</name>
            <description>Flash Write Controller Interrupt</description>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>NVM Write Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NVMOP</name>
                     <description>NVM Operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PREPG</name>
                     <description>NVM Pre-Program Configuration Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRLB</name>
               <description>NVM Control B Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x000000FF</resetValue>
               <fields>
                  <field>
                     <name>SDALCPU0</name>
                     <description>Set DAL for CPU n</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SDALCPU1</name>
                     <description>Set DAL for CPU n</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SDALCPU2</name>
                     <description>Set DAL for CPU n</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>SDALCPU3</name>
                     <description>Set DAL for CPU n</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MUTEX</name>
               <description>NVM MUTEX Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LOCK</name>
                     <description>Flash Write Controller (FCW) Lock by Owner</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OWNER</name>
                     <description>Flash Write Controller (FCW) Owner ID</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>NVM Interrupt Enable Clear Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Operation Done Interrupt Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYERR</name>
                     <description>Key Error Interrupt Enable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error Interrupt Enable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Underrun during Row Write Interrupt Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSERR</name>
                     <description>AHB Bus Error during Row Write Interrupt Enable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Interrupt Enable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>NVMOP Error Interrupt Enable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECERR</name>
                     <description>Security Violation Error Interrupt Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTDPGM</name>
                     <description>High Temperature Detect Error Interrupt Enable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORERR</name>
                     <description>Brown Out Detect Error Interrupt Enable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write Error Interrupt Enable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>NVM Interrupt Enable SET Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Operation Done Interrupt Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYERR</name>
                     <description>Key Error Interrupt Enable Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error Interrupt Enable Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Underrun during Row Write Interrupt Enable Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSERR</name>
                     <description>AHB Bus Error during Row Write Interrupt Enable Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Interrupt Enable Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>NVMOP Error Interrupt Enable Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECERR</name>
                     <description>Security Violation Error Interrupt Enable Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTDPGM</name>
                     <description>High Temperature Detect Error Interrupt Enable Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORERR</name>
                     <description>Brown Out Detect Error Interrupt Enable Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write Error Interrupt Enable Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>NVM Interrupt Flag Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DONE</name>
                     <description>NVM Operation Done Flag Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEYERR</name>
                     <description>Key Error Flag Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGERR</name>
                     <description>Configuration Error Flag Bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FIFOERR</name>
                     <description>FIFO Underrun during Row Write Flag Bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSERR</name>
                     <description>AHB Bus Error during Row Write Flag Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPERR</name>
                     <description>Write Protection Error Flag Bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPERR</name>
                     <description>NVMOP Error Flag Bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SECERR</name>
                     <description>Security Violation Error Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTDPGM</name>
                     <description>High Temperature Detect Error Flag Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BORERR</name>
                     <description>Brown Out Detect Error Flag Bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRERR</name>
                     <description>Write Error Flag Bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>NVM Status Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>NVM Busy Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HTDRDY</name>
                     <description>High Temp Detect Ready Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY</name>
               <description>SFR Unlock Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEYVALUE</name>
                     <description>NVM SFR Key Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>KEYCODE</name>
                     <description>NVM SFR Key Code</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Flash Address Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Flash Address used by NVMOP</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRCADDR</name>
               <description>Source Data Address Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRCADDR</name>
                     <description>Source Data (Word) Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>DATA[%s]</name>
               <description>Flash Write Data Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Flash Write Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWAP</name>
               <description>NVM Panel Swap Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BFSWAP</name>
                     <description>BFM Swap Status/Control Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BFSLOCK</name>
                     <description>BFM Swap Lock Bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFSWAP</name>
                     <description>PFM Swap Status/Control Bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFSLOCK</name>
                     <description>PFM Swap Lock Bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
